{
  "title": "rand",
  "fileName": "rand",
  "sections": [
    {
      "title": "Syntax",
      "raw_content": "<font size=\"+1\"><b>rand</b> (<b>var</b> <i>r</i> : <b>real</b>)<p>\r\n</p></font>",
      "mdown_content": "**rand** (**var** *r* : **real**)"
    },
    {
      "title": "Description",
      "raw_content": "The <b>rand</b> statement is used to create a pseudo-random number in the range zero to one. For example, if <i>x</i> is a real number, after <b>rand</b>(<i>x</i>), <i>x</i> would have a value such as 0.729548 or 0.352879.<p>\r\n</p>",
      "mdown_content": "The **rand** statement is used to create a pseudo-random number in the range zero to one. For example, if *x* is a real number, after **rand**(*x*), *x* would have a value such as 0.729548 or 0.352879."
    },
    {
      "title": "Example",
      "code": [
        "        var r : real\r\n        loop\r\n            rand ( r )\r\n            if r > 0.5 then\r\n                put \"Hi ho, hi ho\"\r\n            else\r\n                put \"It's off to work we go\"\r\n            end if\r\n        end loop"
      ],
      "raw_content": "This program repeatedly and randomly prints out <i>Hi ho</i>,<i> hi ho</i> or <i>It's off to work we go</i>.<p>\r\n</p>",
      "mdown_content": "This program repeatedly and randomly prints out *Hi ho*,* hi ho* or *It's off to work we go*."
    },
    {
      "title": "Details",
      "raw_content": "The <b>rand</b> statement sets its parameter to the next value of a sequence of pseudo-random real numbers that approximates a uniform distribution over the range 0&lt;<i>r</i> &lt;1.<p>\r\nEach time a program runs, <b>rand</b> uses a different pseudo-random number sequence. To get the same sequence (use <b>Rand.Set</b>).</p>\n<p>\r\nTo use several sequences of repeatable pseudo-random number sequences, use the <b>randseed</b> and <b>randnext</b> procedures.</p>\n<p>\r\nIn many languages, <b>rand</b> would be a function rather than a procedure. It has been designed as a procedure in Turing to respect the mathematical idea that every call to a function using the same arguments (or no arguments at all) should return the same value. If <b>rand</b> were a function, this would not be true.</p>\n<p>\r\n</p>",
      "mdown_content": "The **rand** statement sets its parameter to the next value of a sequence of pseudo-random real numbers that approximates a uniform distribution over the range 0<*r* <1.\nEach time a program runs, **rand** uses a different pseudo-random number sequence. To get the same sequence (use **Rand.Set**).\n\nTo use several sequences of repeatable pseudo-random number sequences, use the **randseed** and **randnext** procedures.\n\nIn many languages, **rand** would be a function rather than a procedure. It has been designed as a procedure in Turing to respect the mathematical idea that every call to a function using the same arguments (or no arguments at all) should return the same value. If **rand** were a function, this would not be true.\n"
    },
    {
      "title": "See also",
      "links": [
        "randint",
        "randomize",
        "randseed",
        "randnext",
        "randmodule"
      ],
      "raw_content": "<b><a href=\"randint.html\">randint</a></b>, <b><a href=\"randomize.html\">randomize</a></b>, <b><a href=\"randseed.html\">randseed</a></b> and <b><a href=\"randnext.html\">randnext</a></b>.<p>\r\nSee also predefined unit <b><a href=\"randmodule.html\">Rand</a></b>.</p>\n<p>\r\n</p>",
      "mdown_content": "**[randint.html](randint)**, **[randomize.html](randomize)**, **[randseed.html](randseed)** and **[randnext.html](randnext)**.\nSee also predefined unit **[randmodule.html](Rand)**.\n"
    }
  ]
}
