{
  "title": "Turing Teacher/Administrator Guide",
  "fileName": "turing_admin",
  "sections": [

  ],
  "dependencies": [

  ],
  "htmlcontent": "\r\n<h1>Turing Teacher/Administrator Guide</h1>\r\nThis is the Turing Teacher/Administrator guide. It contains most of the \r\ninformation that you will need to administer the Turing 4.0 software.\r\nIt should be read by those who are teaching courses using Turing 4.0 \r\nor are in charge of administering Turing 4.0\r\n<p>\r\nThis guide provides information on the Turing environment (the editor, the\r\nrun windows, etc.)  It does <b>not</b> provide any information on the Turing\r\nprogramming language itself.\r\n</p>\n<p>\r\nNote that there is some overlap with the <a href=\"turing_quick_admin.html\">Turing\r\nTeacher/Administrator Quick Start Guide</a>.\r\n</p>\n<h2>Table of Contents</h2>\r\n<ol>\n<li>\n<a href=\"\">Making Certain You Have the Lastest Version</a>\r\n  </li>\n<li>\n<a href=\"\">Mandatory Administration Issues</a>\r\n  </li>\n<li>\n<a href=\"\">Changing System Preferences</a>\r\n  </li>\n<li>\n<a href=\"\">Turing Preferences</a>\r\n  </li>\n<li>\n<a href=\"\">Parallel Port and Turing 4</a>\r\n  </li>\n<li>\n<a href=\"\">Missing Features from Turing 4</a>\r\n  </li>\n<li>\n<a href=\"\">The Turing Debugger</a>\r\n  </li>\n<li>\n<a href=\"\">Student Distribution</a>\r\n  </li>\n<li>\n<a href=\"\">Technical Support</a>\r\n</li>\n</ol>\n<h2>\n<a name=\"1\"></a>1. Making Certain You Have the Lastest Version</h2>\r\n  Turing 4.0 is updated regularly.  To find out what version you\r\n  are currently running, click the <b>About Turing</b> menu item in the \r\n  <b>Help</b> menu.  To find out the current version of Turing, go to\r\n  <a href=\"http://www.holtsoft.com/turing/support/#currentversion\">\r\n  http://www.holtsoft.com/turing/support/#currentversion</a>. This lists the\r\n  current version of the software.\r\n  <p>\r\n  This page also lists which bugs have been fixed and when new features have\r\n  been added.  The page also contains a section \r\n  (<a href=\"http://www.holtsoft.com/turing/support/#turing4patches\">\r\n  http://www.holtsoft.com/turing/support/#turing4patches</a>)\r\n  where a file can be downloaded that will update most versions of Turing to \r\n  the latest version.  \r\n  </p>\n<p>\r\n  If you are a teacher or an administrator at a school and require a complete \r\n  installation file (as opposed to the publically available patch), contact Tom\r\n  West at (416) 978-8363.\r\n\r\n</p>\n<h2>\n<a name=\"2\"></a>2. Mandatory Administration Issues</h2>\r\n  Turing 4.0 has been designed to run on either a network or installed on \r\n  individual stand-alone machines.  Running on a network is often preferred\r\n  because of each of installation, however, Turing will load somewhat faster\r\n  when it is launched if it is stored locally.\r\n  <p>\r\n  Turing 4.0 has been designed to run on either a network or installed on \r\n  individual stand-alone machines.  Running on a network is often preferred\r\n  because of ease of administration. However, Turing, like any other application\r\n  will load somewhat faster when it is launched if it is stored locally.\r\n  </p>\n<p>\r\n  There are a few administration issues that must be addressed to configure \r\n  Turing properly.\r\n  </p>\n<ol><li><a name=\"#working_dir\">\r\n        <b>Set the start-in (often called the \"working\") directory properly.</b><p>\r\n        It is important that the start-in directory for Turing be set to the \r\n\tstudent's home directory.  This can be done in a variety of ways, from\r\n\tleast to most complicated.\r\n\t</p>\n<p>\r\n\t</p>\n<ol type=\"i\">\n<li>Many schools have the student's home directory mapped to a drive\r\n\t      (often H:\\). If this is the case, then set the start-in (or \r\n\t      working) directory of the shortcut or menu item used to launch \r\n\t      Turing to the mapped drive.\r\n\t      <p>\r\n  \t      The shortcut's working directory can be modified by\r\n\t      changing it's start-in or working directory property. (To \r\n\t      display the <b>Properties</b> dialog box, right click on the \r\n\t      shortcut or menu item and select Properties from the pop-up menu.)\r\n\t      </p>\n<p> \r\n  \t      </p>\n<center>\r\n    \t        <img src=\"turing_admin03.gif\"><br><b>Properties for a Shortcut under Windows 2000</b>\r\n  \t      </center>\r\n\t      <p> \r\n\t      This requires changing the shortcut's properties requires\r\n\t      write access to the shortcut.  Note that commercial menu \r\n\t      front-ends have their own way of setting the start-in \r\n\t      directory of applications.\r\n\t     </p>\n<p>\r\n\t  </p>\n</li>\n<li>If the \"My Documents\" folder is mapped to the students home \r\n\t      directory, you can set the preferences to make Turing use the \r\n\t      \"My Documents\" folder as the start-in folder.  Note that  \r\n\t      this option is the preferred option for home users, where the \r\n\t      \"My Documents\" folder is the home directory.\r\n\t      <p> \r\n  \t      </p>\n<center>\r\n    \t        <img src=\"turing_admin08.gif\"><br><b>The Use \"My Documents\" Folder in the Admin Pane</b>\r\n  \t      </center>\r\n\t      <p> \r\n\t      To change the preference, enter Administrator \r\n\t      mode (see <a href=\"\">Changing System Preferences</a> below) \r\n\t      and set the <b>Use \"My Documents\" Folder</b> checkbox in the\r\n\t      <b>Admin</b> pane of the Turing Preferences (see \r\n\t      <a href=\"\">Turing Preferences</a> below).\r\n\t      </p>\n<p>\r\n\t  </p>\n</li>\n<li>If each student's home directory is specified differently (i.e. \r\n\t      there is no mapping of the home directory to a drive), then \r\n\t      you may need to use environment variables to create a useable \r\n\t      path.  For example, if students files are stored \r\n\t      in <b>g:\\class108\\[Student Name]</b> and there is an environment\r\n\t      variables USERNAME that contains the student's name, then the \r\n\t      the start-in directory for the shortcut should be set to\r\n\t      <tt>g:\\class108\\%USERNAME%</tt>.\r\n\t     <p>\r\n\t  </p>\n</li>\n<li>Occasionally users have reported situations like the previous \r\n\t      case, except that Windows seems unable to set the start-in \r\n\t      directory properly using environment variables.  \r\n\t      <p> \r\n  \t      </p>\n<center>\r\n    \t        <img src=\"turing_admin09.gif\"><br><b>The Startup Directory Text Field in the Admin Pane</b>\r\n  \t      </center>\r\n\t      <p> \r\n\t      To set the start-in directory, enter Administrator \r\n\t      mode (see <a href=\"\">Changing System Preferences</a> below) \r\n\t      and set the <b>Startup Directory</b> text field in the\r\n\t      <b>Admin</b> pane of the Turing Preferences appropriately (see \r\n\t      <a href=\"\">Turing Preferences</a> below) including specifying\r\n\t      the directory using the environment variables.\r\n\t</p>\n</li>\n</ol>\n<p>\r\n    </p>\n<li>\n<b>Set either Beginner or Regular Mode for Students.</b><p>\r\n    \t</p>\n<p>\r\n        Turing can be set to <b>Beginner</b> mode, in which case only one\r\n\tfile is open at a time.  Opening up another file closes the first one.\r\n\tWhen the program is running, the Editor window minimizes. In this way,\r\n\tonly one window is usually visible at a time. In this fashion, \r\n\t<b>Beginner</b> mode is similar to the old DOS Turing.</p>\n<p>\r\n\tIn <b>Regular</b> mode, any number of files can be opened and each\r\n\tappears in its own editor window.\r\n\t</p>\n<p>\r\n\tIn general, we suggest <b>Beginner</b> mode for grade 9 and 10 and\r\n\t<b>Regular</b> mode for all others.  If you are using <b>Beginner</b>\r\n\tmode, we suggest that you point out to the students that they can use\r\n\tthe Prefences to change to <b>Regular</b> mode when they feel \r\n\tcomfortable with the environment.\r\n\t</p>\n<p>\r\n\tTo change the preference, you will need to enter Administrator mode \r\n\t(see <a href=\"\">Changing System Preferences</a> below) and change\r\n\tthe <b>Beginner Mode</b> preference in the <b>General</b> pane \r\n\tappropriately (see <a href=\"\">Turing Preferences</a> below).\r\n\t</p>\n<p>\r\n    </p>\n</li>\n<li>\n<b>Windows 95 and the Turing Net module</b>\r\n        <p>\r\n        If you are using Windows 95 (not Windows 98/Me/NT/2000/XP) and you\r\n        wish to use the Turing <b>Net</b> module in order to write programs\r\n        that communicate with other computers, then you may need update the\r\n        Window 95 networking code.\r\n        </p>\n<p>\r\n        This can be done by running the program located at:\r\n        </p>\n<p>\r\n        </p>\n<center>\r\n          [Turing directory]\\support\\Microsoft\\W95ws2setup.exe\r\n        </center>\r\n        <p>\r\n        This program from Microsoft patches Windows 95 networking code.  It\r\n        must be run on every computer running Windows 95 unless the machines\r\n        boot from a server.\r\n    </p>\n</li>\n<li>\n<b>Parallel Port Usage</b>\r\n        If you are intend to use Turing to control devices attached to the\r\n        parallel port (using the <b>parallelput</b> and <b>parallelget</b>,\r\n        and are running under Windows NT/XP/2000, you will need to install a\r\n        device driver. (Windows NT/XP/2000 do not allow direct access to the\r\n        system hardware.).  The device driver can be installed by running the\r\n        program located at:\r\n        <p>\r\n        </p>\n<center>\r\n          [Turing directory]\\support\\dlportio_install.exe\r\n        </center>\r\n        <p>\r\n        Further information can be found in <a href=\"\">Parallel Port \r\n        and Turing 4</a>.\r\n  </p>\n</li></a></li></ol>\n<h2>\n<a name=\"3\"></a>3. Changing System Preferences</h2>\r\n  Turing uses a two level preference model.  There is a central set of\r\n  preferences that are kept in\r\n  <p>\r\n  <b>    [Turing Directory]\\Support\\Ini\\turing_admin.ini</b>\r\n  </p>\n<p>\r\n  These preferences are the same for all users and are called the <b>System\r\n  Preferences</b>.  A second set of preferences \r\n  is stored in each student's home directory in a file called <b>turing.ini</b>.  \r\n  These preferences override the central preferences and allow students to \r\n  individually modify the behaviour of Turing.\r\n  </p>\n<p>\r\n  When a student modifies the preferences, the <b>turing.ini</b> file in the \r\n  student's home directory is \r\n  changed. To change the System preferences (i.e. the contents of the \r\n  <b>turing_admin.ini</b> file), Turing must be started\r\n  up with the command line\r\n  </p>\n<p>\r\n  <b>    turing  -admin</b>\r\n  </p>\n<p>\r\n  This can be done by starting up a DOS window, doing a <b>cd</b> to the\r\n  directory in which <b>turing.exe</b> is stored and then typing \r\n  <b>turing  -admin</b>. The user must have write access to the \r\n  directory in which the <b>turing_admin.ini</b> file is stored.\r\n  </p>\n<p>\r\n  When Turing is launched, it will display a message box on start-up indicating\r\n  that it is in <b>Administrator mode</b> and where the preferences will be\r\n  stored.\r\n  </p>\n<p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin01.gif\"><br><b>Administration Mode Notification</b>\r\n  </center>\r\n  <p>\r\n  Selecting <b>Preferences</b> from the <b>File</b> menu will display a tabbed\r\n  dialog box of all the Turing preferences.  If you are in <b>Administrator \r\n  mode</b>, then an extra tab labeled <b>Admin</b> will appear with extra\r\n  preferences that can only be set by the Administrator.  Note that individual\r\n  students cannot override the preferences that appear on the <b>Admin</b> pane.\r\n  </p>\n<p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin02.gif\"><br><b>Preferences in Administrator Mode</b>\r\n  </center>\r\n  <p>\r\n  Once the Preferences have been set, the Administrator can exit Turing.\r\n\r\n</p>\n<h2>\n<a name=\"4\"></a>4. Turing Preferences</h2>\r\n  This section lists all the preferences available in Turing sorted by the\r\n  pane\r\n  <h3>\"General\" Pane</h3>\r\n  <p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin02.gif\"><br><b>The \"General\" Pane</b>\r\n  </center>\r\n  <p>\r\n  </p>\n<ul>\n<li>\n<b>Beginner Mode</b><br>\r\n        When <b>Beginner</b> mode is set, only one file can\r\n        be can be loaded into the Turing environment at a time.  The Editor\r\n        window is minimized every time the Run window is active and vice-versa.\r\n        The debugger cannot be displayed or used.  If this box is not set, then\r\n        Turing is in <b>Regular</b> mode and multiple files can be open \r\n        simultaneously.  <b>Beginner</b> mode is recommended for students who\r\n        are overwhelmed or confused by too many Turing windows (especially\r\n        students in grades 9 and 10).\r\n    </li>\n<li>\n<b>One Window Mode</b><br>\r\n        This option is not available in Turing 4.0.  It will be used to switch\r\n        between MDI and SDI modes in a future version of the software.\r\n    </li>\n<li>\n<b>Display Full Pathnames</b><br>\r\n        The full path name and not just the file name are displayed in the \r\n        Editor window's title bar and recent files submenu.\r\n    </li>\n<li>\n<b>Save Previous File as \".BAK\"</b><br>\r\n        When a file is saved over top of an older file, the older file is \r\n        renamed with a .BAK suffix (i.e. <b>test.t</b> to <b>test.bak</b>)\r\n    </li>\n<li>\n<b>Confirm on Quit</b><br>\r\n        When the user closes the last editor window, Turing displays a dialog \r\n        box asking whether the user wishes to Quit. On systems where loading \r\n        is slow (usually over a network), this can stop the users from \r\n        accidentally quitting Turing.\r\n    </li>\n<li>\n<b>Skip Splash Screen</b><br>\r\n        When Turing starts up, it normally displays a \"Splash\" screen with\r\n        the version number.  The Splash screen disappears when the user clicks\r\n        a button or after 3 seconds.  Turning this option off causes the \r\n        Splash screen not to be displayed.\r\n    </li>\n<li>\n<b>Add \".t\" to File Names</b><br>\r\n        When a Save File dialog box appears and the user specifies a file name \r\n        without a file suffix, Turing adds \".t\".  This can be removed by the\r\n        user.\r\n    </li>\n<li>\n<b>Convert Leading Spaces into Tabs</b><br>\r\n        When Turing saves a file, it normally converts groups of leading spaces\r\n        into TAB characters, saving disk space.  The number of spaces per tab is\r\n        specified by the <b>Spaces per Tab</b> text field.  If this check box is\r\n        not selected, then the spaces are not converted.\r\n    </li>\n<li>\n<b>Don't Save Recent Files Menu</b><br>\r\n        Normally Turing lists the last several files opened. However, if \r\n        students do not have individual accounts, then this feature may \r\n        not be useful and can be turned off.\r\n    </li>\n<li>\n<b>Find Uses Selected Text</b><br>\r\n        By default, Turing uses the Windows behaviour that when a Find command\r\n        is given and there is selected text, the selected text is copied to\r\n        the Find dialog box.  If you don't like this behaviour, then unsetting\r\n        this option will stop this behaviour. If it is not set, then \r\n        an additional menu item is placed in the <b>Search</b> menu that finds\r\n        the next occurance of the currently selected text.\r\n    </li>\n<li>\n<b>Start in Last Active Directory</b><br>\r\n        If students are writing large projects in many subdirectories, then \r\n        this option can be enabled to automatically start Turing in the last \r\n        directory in which a file was loaded or saved. The Turing preferences \r\n        file is still stored in the student's home directory.\r\n    </li>\n<li>\n<b>Spaces per Tab</b><br>\r\n        This specifies the number of spaces that a Tab is converted to and from.\r\n        When Turing reads a text file into the editor, all tabs are converted on\r\n        to spaces. If you created the Turing file on an editor where Tabs\r\n        are a different number of spaces, then change this value appropriately.\r\n    </li>\n<li>\n<b>Indent Size</b><br>\r\n        When Tab is pressed in the Turing editor, it is converted into spaces.\r\n        The number in the <b>Indent Size</b> text field determines how many\r\n        spaces the Tab key is converted to.  Note the <b>Spaces per Tab</b> is\r\n        used when Turing reads/writes files.  The <b>Indent Size</b> field is\r\n        used when Turing responds to the Tab key.\r\n    </li>\n<li>\n<b>File Association</b><br>\r\n        Microsoft Windows has the ability to associate files with a particular\r\n        suffix with specific programs. The Turing environment can be associated\r\n        with the following file suffixes: <b>.t</b>, <b>.tur</b>, <b>.dem</b>, \r\n        <b>.ti</b> and <b>.tu</b>.  To associate these file suffixes with \r\n        Turing, click the <b>Associate \".t\" files with Turing</b> button. To\r\n        reset the file associations back to what they were before, click the\r\n        <b>Reset \".t\" File Association</b>.\r\n  </li>\n</ul>\n<p>\r\n  </p>\n<h3>\"Editor Window\" Pane</h3>\r\n  <p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin04.gif\"><br><b>The \"Editor Window\" Pane</b>\r\n  </center>\r\n  <p>\r\n  </p>\n<ul>\n<li>\n<b>Editor Font</b><br>\r\n        You can change the font size and typeface used in the editor window. \r\n        If you change the typeface, you must choose a monospaced font where \r\n        bold and non-bold letters are the same size. Many monospaced fonts \r\n        have different sizes for bold and non-bold letters.\r\n    </li>\n<li>\n<b>Full Screen for Beginner Mode</b><br>\r\n        If in beginner mode, editor windows are automatically in full \r\n        screen mode.  You can change this behaviour buy unsetting this checkbox.\r\n    </li>\n<li>\n<b>Full Screen for Regular Mode</b><br>\r\n        Editor windows are normally 25x80 columns (or the size specified by the\r\n        <b>Editor Window Rows/Columns</b> text fields).  If this checkbox is\r\n        set, editor windows are automatically maximized to fill the screen. \r\n        This option is suggested for systems with 640x480 screen resolution. \r\n        Users can change the window size by clicking the full screen/normal \r\n        window button in the window's title bar.\r\n    </li>\n<li>\n<b>Editor Window Rows/Columns</b><br>\r\n        These text fields control the size of editor windows when first created.\r\n    </li>\n<li>\n<b>Syntax Coloring</b><br>\r\n        When selected, parts of Turing programs appear in different colors: \r\n        comments appear in green, strings in red, keywords in bold face, \r\n        predefined identifiers in black, and user identifiers in blue.\r\n    </li>\n<li>\n<b>Always Show 'Debugger' Menu</b><br>\r\n    \tIn the interest of keeping the interface as simple as possible, and \r\n    \tbecause most students do not use the debugging features, Turing does\r\n    \tnot display the Debugger menu by default.  Instead, the user selects\r\n    \t<b>Show Debugger Menu</b> from the <b>Run</b> menu.  Setting this\r\n    \tcheckbox causes the Debugger menu to always be displayed. \r\n    </li>\n<li>\n<b>Text Cursor Width</b><br>\r\n        By default, the cursor (correctly called the caret) is 2 pixels wide, \r\n        allowing it to be seen easily in the Editor window.  However, some \r\n        users prefer the caret to be 1 pixel wide and some prefer the caret \r\n        to overlay an entire character (in a similar manner to DOS editors). \r\n        Legal values are 1 (which represent a 1 pixel thick caret), 2 (which \r\n        represent a 2 pixel thick caret), and 3 (which represents a text cursor \r\n        that covers the entire character.\r\n  </li>\n</ul>\n<p>\r\n  </p>\n<h3>\"Run Window\" Pane</h3>\r\n  <p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin05.gif\"><br><b>The \"Run Window\" Pane</b>\r\n  </center>\r\n  <p>\r\n  </p>\n<ul>\n<li>\n<b>Default Run Window Font</b><br>\r\n        You can change the font size and typeface used in the Turing run window. \r\n        If you change the typeface, you must choose a monospaced font. Note that \r\n        changing the size of the run window font may cause odd output in Turing \r\n        programs that were written assuming a particular character size.\r\n    </li>\n<li>\n<b>Start in Graphics Mode</b><br>\r\n        This makes the initial run window a graphics window. The user can use \r\n        graphics without the setscreen (\"graphics\") command in the program. \r\n        Output that scrolls off the top of the screen is lost. In text mode, \r\n        graphics are not allowed, but all text output is kept and can be \r\n        scrolled, saved, and printed at any time.\r\n    </li>\n<li>\n<b>Full Screen Run Window</b><br>\r\n        This causes the default run window to occupy the entire screen.\r\n    </li>\n<li>\n<b>Run Window Rows/Columns</b><br>\r\n        This sets the size of the default run window. Changing the size may \r\n        cause programs that assume a 25x80 window to malfunction.\r\n    </li>\n<li>\n<b>Use Small Fonts on 640x480 Screen</b><br>\r\n        A standard 25x80 window does not quite fit on a 640x480 screen with a \r\n        standard size task bar. As a result, without this option, the default \r\n        graphics mode run window appears with scroll bars. This option causes \r\n        Turing to use a slightly smaller font for 640x480 run windows so the \r\n        entire window fits on the screen. This option may cause odd output in \r\n        Turing programs that were written assuming a particular character size.\r\n  </li>\n</ul>\n<p>\r\n  </p>\n<h3>\"Printing\" Pane</h3>\r\n  <p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin06.gif\"><br><b>The \"Printing\" Pane</b>\r\n  </center>\r\n  <p>\r\n  Note that the options marked with an asterisk (*) can be set in the printing\r\n  dialog.\r\n  </p>\n<ul>\n<li>\n<b>Printing Font/Printing Header Font</b><br>\r\n        You can change the font size and typeface used in printing. If you \r\n        change the typeface, you must choose a monospaced font where bold and \r\n        non-bold letters are the same size. Many monospaced fonts have different \r\n        sizes for bold and non-bold letters.\r\n    </li>\n<li>\n<b>Bold Keywords/Italicize Identifiers</b> *<br>\r\n        This allows for \"syntax coloring\" of printouts.  Keywords can be placed\r\n        in bold and identifiers italicized.\r\n    </li>\n<li>\n<b>Print Page Header</b><br>\r\n        On some systems, a header page is automatically printed out and there is\r\n        little reason for a page header.  Unsetting this checkbox will cause\r\n        printouts not to have any header on the printed programs.\r\n    </li>\n<li>\n<b>User Name in Header</b><br>\r\n        Normally the user name is displayed in the header. However, on some\r\n        systems the user name is non-descriptive or non-existent.  This allows\r\n        you to disable the printing of the user name on such systems.\r\n    </li>\n<li>\n<b>Two-Up Printing</b> *<br>\r\n        This is a paper saving measure. Text is printed in landscape mode with \r\n        two \"pages\" per piece of paper. This means that listings use half the \r\n        amount of paper. Of course, the font is much smaller.\r\n    </li>\n<li>\n<b>Line Numbers</b> *<br>\r\n        This prints out line numbers in front of each line of the program. This \r\n        is useful if you are printing out a listing to hand out to the class.\r\n    </li>\n<li>\n<b>Border Around Text</b><br>\r\n        Some users like to have a thin border printed around the text for ease\r\n        of determining the margins, etc.  Setting this checkbox causes Turing\r\n        to display a hairline border around program printouts.\r\n    </li>\n<li>\n<b>Margins</b><br>\r\n    \tIf you need to change the margins on printouts (for example, to \r\n    \tfacilitate the insertion of program listings into 3-ring binders), then\r\n    \tyou can do by changing the values in the text fields.  Margins are\r\n    \texpressed in inches.\r\n    </li>\n<li>\n<b>User Name</b><br>\r\n        On systems where the user name is non-descriptive or non-existent, \r\n        the user can enter a name that will appear on the printout allowing \r\n        it to be identified. If students are choosing inappropriate user names, \r\n        this preference can be disabled in the Admin tab preference dialog.\r\n  </li>\n</ul>\n<p>\r\n  </p>\n<h3>\"Admin\" Pane</h3>\r\n  <p>\r\n  </p>\n<center>\r\n    <img src=\"turing_admin07.gif\"><br><b>The \"Admin\" Pane</b>\r\n  </center>\r\n  <p>\r\n  Note, the <b>Admin</b> pane is only available in administrator mode. Students \r\n  starting Turing will not have access to this dialog box.\r\n  </p>\n<ul>\n<li>\n<b>Startup Directory</b><br>\r\n        Users will start in the directory listed in this text field. If left \r\n        blank, Turing will use the working directory of the shortcut used to \r\n        start Turing. If no working directory for the shortcut is specified, \r\n        the directory where Turing is installed is used. Environment variables \r\n        prefixed and suffixed with % signs can be used here (example: \r\n        g:\\students\\%username%).  Note that in most cases, this text field \r\n        should be blank.\r\n    </li>\n<li>\n<b>Use \"My Documents\" folder</b><br>\r\n        The \"My Documents\" folder can be used as the startup directory instead\r\n        of the contents of the Startup Directory text field. This is most \r\n        commonly used in single user systems.\r\n    </li>\n<li>\n<b>Can Set User Name</b><br>\r\n        Allows the user to specify the user name to appear on top of printouts.\r\n        This checkbox can be unset if students are choosing inappropriate \r\n        user names.\r\n    </li>\n<li>\n<b>Can Enter Regular Mode</b><br>\r\n        Allows the user to turn off the beginner mode preference.  This \r\n        checkbox can be unset if it is desirable to have all students working\r\n        in beginner mode.\r\n    </li>\n<li>\n<b>Debugger Available</b><br>\r\n        This checkbox can be unset in order to stop students getting access to\r\n        the debugger.\r\n    </li>\n<li>\n<b>Cannot Alter Preferences</b><br>\r\n        When set, this stops students from accessing the Preferences dialog. \r\n        It also stops Turing from reading the student's <b>turing.ini</b> file.\r\n        This can be set when it is important to have a uniform set of \r\n        preferences on all student machines, or when there is no log-on \r\n        procedure and students are sharing machines.\r\n    </li>\n<li>\n<b>Prohibit use of 'Sys.Exec'</b><br>\r\n        When set, the <b>Sys.Exec</b> and <b>system</b> procedures do nothing.\r\n        This can be set if there is a system security concern about students\r\n        starting arbitrary programs.\r\n    </li>\n<li>\n<b>No Sound or Music</b><br>\r\n        When set, the Turing sound and music commands do nothing.\r\n    </li>\n<li>\n<b>Use only Startup Directory and Below</b><br><b>CAUTION!</b> This option only provides rudimentary security and \r\n        is to be used only on systems where the operating system cannot \r\n        provide proper security. This option will not allow students to \r\n        save or load to any directory other that their startup directory \r\n        or directories created in the startup directory. This option does \r\n        not stop students from browsing the names of files in other \r\n        directories, only from loading or saving files in them.\r\n    </li>\n<li>\n<b>Use Only Allowed Drives</b><br><b>CAUTION!</b> This option only provides rudimentary security and \r\n        is to be used only on systems where the operating system cannot \r\n        provide proper security. This option allows students to load \r\n        files only from the set of drives specified in the text field. The\r\n        '*' represents network drives.\r\n    </li>\n<li>\n<b>Forbid Use of Certain Drives</b><br><b>CAUTION!</b> This option only provides rudimentary security and \r\n        is to be used only on systems where the operating system cannot \r\n        provide proper security. This option prevents students from loading\r\n        files from the set of drives specified in the text field. The\r\n        '*' represents network drives.\r\n  </li>\n</ul>\n<h2>\n<a name=\"parallel\"></a>5. Using the Parallel Ports in Turing 4</h2>\r\n  Under Turing 4.0 and , it is possible to access the IBM PC's parallel port \r\n  for reading and writing. This is normally done using the <b>parallelput</b> \r\n  and <b>parallelget</b> commands. (In Turing 4.0, you can use \r\n  <b>PC.ParallelPut</b> and <b>PC.ParallelGet</b> to access ports other than \r\n  LPT1.)\r\n  <p>\r\n  Under Windows 95/98 and Me, the operating system allows direct access to \r\n  the parallel port. Under Windows NT, 2000 and XP, access to the parallel \r\n  port is restricted by the operating system. In order to access the port, \r\n  under Windows NT, 2000 and XP, it is necessary to install a device driver on\r\n  each machine that will be accessing the parallel port. The needed device\r\n  driver installer is located at:\r\n  </p>\n<p>\r\n  </p>\n<center>\r\n    [Turing directory]\\support\\dlportio_install.exe\r\n  </center>\r\n  <p>\r\n  where <b>[Turing directory]</b> is the directory in which Turing was \r\n  installed.  Executing this program will install the device driver in the\r\n  Windows System directory of the machine upon which it is executed.\r\n  </p>\n<p>\r\n  Lastly, before accessing the parallel port, check that the parallel port \r\n  is in <b>normal</b> mode and not in <b>bi-directional</b>, <b>PS/2</b>, \r\n  <b>EPP</b> or <b>ECP</b> mode. You can determine which mode the parallel \r\n  port is in using the Device Manager. In the list of devices in the Device \r\n  Manager window, double click <b>Ports (COM and LPT)</b>, and then the \r\n  <b>LPT</b> (or <b>PRN</b>) port. This displays a property sheet about \r\n  the parallel port. Take a look at what it says about it. If it is in a \r\n  non-original mode (i.e. mentions <b>bi-directional</b>, <b>PS/2</b>, \r\n  <b>EPP</b> or <b>ECP</b> mode), then you will probably need to adjust the \r\n  systems BIOS settings.\r\n  </p>\n<p>\r\n  (Under Windows 2000 the Device Manager can be displayed by selecting the \r\n  System Control Panel from Settings in the Start menu. Select the Hardware \r\n  tab and then click the Device Manager button.) \r\n  </p>\n<p>\r\n  If the setting for the parallel port needs to be changed, restart the machine, \r\n  and press the appropriate key to enter the BIOS Set Up Program (the key varies \r\n  between machines, but is usually noted on the screen).  Often the parallel \r\n  port settings are found in <b>Advanced Settings</b> of the program.  The \r\n  parallel port should be set to <b>Normal</b>, <b>Standard</b>, <b>AT</b> \r\n  or <b>Unidirectional</b> mode.  (All four names are different descriptions \r\n  of the same mode.) Once this is done and the new settings are saved, then \r\n  start the machine into Windows.  Once in Windows, select <b>Shut Down</b>\r\n  and turn the machine completely off.  Once the machine is off, wait at \r\n  least 10 seconds in the powered-off state.  Then restart the machine.\r\n  (While shutting down the machine should not be necessary, we have had several\r\n  cases where the change only <i>took</i> when the machine had been powered-down\r\n  and restarted.)\r\n\r\n</p>\n<h2>\n<a name=\"6\"></a>6. Missing Features from Turing 4</h2>\r\n  Turing 4.0 does not yet incorporate all the features that currently exist \r\n  in Object Oriented Turing 3.1.1 and are intended for future Turing releases. \r\n  Over the next few months, new features will be added and updates to Turing \r\n  will be made available on our web site. The features to be added are:\r\n  <ul>\n<li>View Variables\r\n    </li>\n<li>The Sprite module\r\n  </li>\n</ul>\r\n  If you have immediate need of any of these features, please continue to \r\n  use the Object Oriented Turing 3.1.1 software. Ontario users can obtain \r\n  the software through their OESS software representative. \r\n  <p>\r\n  To determine the current release of Turing, check the Turing web site at\r\n  </p>\n<center>\r\n    <a href=\"http://www.holtsoft.com/turing/support/#currentversion\">\r\n    http://www.holtsoft.com/turing/support</a>\r\n  </center>\r\n\r\n<h2>\n<a name=\"7\"></a>7. The Turing Debugger</h2>\r\n  The current version of Turing has a Debugger facilities that allow students\r\n  to follow execution of a program either pausing after each line of execution\r\n  or executing slowly while highlighting each line of execution.  Because of\r\n  the confusing nature of the debugger for many students, the default \r\n  configuration of Turing does not display the debugger menu until the student\r\n  requests it by selecting the <b>Show Debugger Menu</b> from the <b>Run</b> \r\n  menu.\r\n  <p> \r\n  </p>\n<center>\r\n    <img src=\"turing_admin10.gif\"><br><b>Always Show 'Debugger' Menu in the Editor Window Pane</b>\r\n    </center>\r\n  <p> \r\n  If you wish students to have a more regular exposure to the Debugger, you\r\n  can set a System preference to cause Turing to always display the Debugger \r\n  menu. To set the this preference, enter Administrator mode (see \r\n  <a href=\"\">Changing System Preferences</a> below) \r\n  and set the <b>Always Show 'Debugger' Menu</b> checkbox in the\r\n  <b>Editor Window</b> pane of the Turing Preferences.\r\n  \r\n</p>\n<h2>\n<a name=\"8\"></a>8. Student Distribution of Turing 4.0</h2>\r\n  The Ontario Ministry license does not include the right to redistribute the \r\n  software to students. If you wish to give the software to students, a \r\n  separate license must be obtained directly from Holt Software. \r\n  <p>\r\n  If your school does not have such a license, students can purchase the \r\n  software for home use by printing and then mailing an order form found\r\n  <a href=\"http://www.holtsoft.com/studentbuy\">http://www.holtsoft.com/studentbuy</a>.  \r\n  This order form can also be used to allow interested students to purchase \r\n  textbooks.\r\n  </p>\n<p>\r\n  If your school has purchased a redistribution license (almost 200 schools have\r\n  done so), then you may redistribute the Turing software to your students. \r\n  You can either burn copies of the CD to distribute to students or place the \r\n  Turing installer file onto your school Internet server and give your students \r\n  the URL. \r\n  </p>\n<p>\r\n  <b>If you place this file on your school internet server, you must not make \r\n  any links from your web pages to the software.</b>\r\n  </p>\n<p>\r\n  This will prevent other users of the web from downloading your software. If \r\n  you place links from your school's web site, then at some point a web search \r\n  engine will find the software and post its location to the internet at large, \r\n  allowing for large scale piracy (and a very overloaded school web server). \r\n  If there are no links to the software, then only those who have been told \r\n  the exact URL will be able to download the software.\r\n  </p>\n<p>\r\n  Note that if you are copying a number of different programs onto a single \r\n  CD for redistribution, you may rename the Turing installer program to \r\n  something more descriptive.\r\n  </p>\n<p>\r\n  Permanent student redistribution licenses can be purchased for $500-$750 \r\n  for most schools. If you are interested in purchasing a student \r\n  redistribution license, contact Chris Stephenson at (416) 978-6476 or \r\n  <a href=\"mailto:chris@hsa.on.ca\">chris@hsa.on.ca</a>\r\n\r\n</p>\n<h2>\n<a name=\"9\"></a>9. Technical Support</h2>\r\n  If you have problems, questions or suggestions about the Turing software, \r\n  contact technical support at:\r\n  <center>\r\n  <table>\n<tr>\n<td>Telephone:</td>\n<td width=\"20\"> </td>\n<td>(416) 978-8363\r\n         </td>\n</tr>\n<tr>\n<td>Toll free:</td>\n<td></td>\n<td>1-800-361-8324\r\n         </td>\n</tr>\n<tr>\n<td>Fax:</td>\n<td></td>\n<td>(416) 978-1509\r\n         </td>\n</tr>\n<tr>\n<td>E-mail:</td>\n<td></td>\n<td>\n<a href=\"mailto:west@hsa.on.ca\">west@hsa.on.ca</a>\r\n  </td>\n</tr>\n</table>\n</center>\r\n"
}
